In [87]:
import pandas as pd

In [89]:
data ={ "name" :["a","b","c","d","a","d","b"], "eng":[8,7,5,8,8,3,7], "hindi":[2,3,4,5,2,6,3]}

In [91]:
df = pd.DataFrame(data)

In [93]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    d    3      6
6    b    7      3

In [95]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [101]:
df.drop_duplicates(keep="first", inplace=True)

In [103]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    d    3      6

In [105]:
df1 = pd.read_csv("temperatures.csv")

In [107]:
df1.head()

,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL,JAN-FEB,MAR-MAY,JUN-SEP,OCT-DEC
0,1901,22.40,24.14,29.07,31.91,33.41,33.18,31.21,30.39,30.47,29.97,27.31,24.49,28.96,23.27,31.46,31.27,27.25
1,1902,24.93,26.58,29.77,31.78,33.73,32.91,30.92,30.73,29.80,29.12,26.31,24.04,29.22,25.75,31.76,31.09,26.49
2,1903,23.44,25.03,27.83,31.39,32.91,33.00,31.34,29.98,29.85,29.04,26.08,23.65,28.47,24.24,30.71,30.92,26.26
3,1904,22.50,24.73,28.21,32.02,32.64,32.07,30.36,30.09,30.04,29.20,26.36,23.63,28.49,23.62,30.95,30.66,26.40
4,1905,22.00,22.83,26.68,30.01,33.32,33.25,31.44,30.68,30.12,30.67,27.52,23.82,28.30,22.25,30.00,31.33,26.57

In [109]:
df1.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
112    False
113    False
114    False
115    False
116    False
Length: 117, dtype: bool

In [117]:
df1.shape

(117, 18)

In [119]:
df1.drop_duplicates(keep="first", inplace=True)

In [121]:
df1.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
112    False
113    False
114    False
115    False
116    False
Length: 117, dtype: bool

In [125]:
df1.shape #no duplicate values as same shape brfore removing duplicate data

(117, 18)